model_name: perf_streaming_frontend__diarizer_mock
description: |
  Streaming front-end showcase: deterministic diarizer mock. Returns one
  RTTM-shaped segment per FRAME line in the full audio buffer, preserving
  the embedded speaker tag and synthesizing plausible start/end times.
model_class_filename: model.py
model_class_name: Model
python_version: py311
resources:
  cpu: "0.5"
  memory: 256Mi
  use_gpu: false
runtime:
  predict_concurrency: 4
