{"_id":"6478cc07dbf97e0b5cc3ff52","id":"teknium/Replit-v2-CodeInstruct-3B","modelId":"teknium/Replit-v2-CodeInstruct-3B","author":"teknium","sha":"25739b4738c6f523ec383b7d599117913e33c26a","lastModified":"2023-06-07T09:32:19.000Z","private":false,"disabled":false,"gated":false,"pipeline_tag":"text-generation","tags":["pytorch","mpt","text-generation","custom_code","code","dataset:bigcode/the-stack-dedup","dataset:sahil2801/CodeAlpaca-20k","dataset:teknium/GPTeacher-CodeInstruct","transformers","instruct","self instruct","license:cc-by-sa-4.0","has_space"],"downloads":889,"library_name":"transformers","likes":33,"model-index":null,"config":{"architectures":["MPTForCausalLM"],"model_type":"mpt","auto_map":{"AutoConfig":"configuration_mpt.MPTConfig","AutoModelForCausalLM":"modeling_mpt.MPTForCausalLM"}},"cardData":{"license":"cc-by-sa-4.0","datasets":["bigcode/the-stack-dedup","sahil2801/CodeAlpaca-20k","teknium/GPTeacher-CodeInstruct"],"model-base":["replit/replit-code-v1-3b"],"tags":["code","instruct","self instruct"],"language":["code"],"programming_language":["Markdown","Java","JavaScript","Python","TypeScript","PHP","SQL","JSX","reStructuredText","Rust","C","CSS","Go","C++","HTML","Vue","Ruby","Jupyter Notebook","R","Shell"]},"transformersInfo":{"auto_model":"AutoModelForCausalLM","custom_class":"modeling_mpt.MPTForCausalLM","pipeline_tag":"text-generation"},"spaces":["teknium/Replit-v2-CodeInstruct-3b","amasad/Replit-v2-CodeInstruct-3b"],"siblings":[{"rfilename":".gitattributes"},{"rfilename":"README.md"},{"rfilename":"adapt_tokenizer.py"},{"rfilename":"added_tokens.json"},{"rfilename":"attention.py"},{"rfilename":"blocks.py"},{"rfilename":"config.json"},{"rfilename":"configuration_mpt.py"},{"rfilename":"generation_config.json"},{"rfilename":"hf_prefixlm_converter.py"},{"rfilename":"meta_init_context.py"},{"rfilename":"modeling_mpt.py"},{"rfilename":"norm.py"},{"rfilename":"param_init_fns.py"},{"rfilename":"pytorch_model-00001-of-00002.bin"},{"rfilename":"pytorch_model-00002-of-00002.bin"},{"rfilename":"pytorch_model.bin.index.json"},{"rfilename":"replit_lm_tokenizer.py"},{"rfilename":"special_tokens_map.json"},{"rfilename":"spiece.model"},{"rfilename":"tokenizer_config.json"}]}
