model_name: voice_agent_mocked__tts_mock
description: |
  Voice-agent showcase: deterministic TTS mock. Encodes text into a
  MOCKAUDIO|<text>|END envelope and returns base64-encoded bytes plus
  fake duration metadata.
model_class_filename: model.py
model_class_name: Model
python_version: py311
resources:
  cpu: "0.5"
  memory: 256Mi
  use_gpu: false
runtime:
  predict_concurrency: 4
