model_name: voice_agent_mocked__stt_mock
description: |
  Voice-agent showcase: deterministic STT mock. Decodes MOCKAUDIO envelope
  and returns the embedded text plus fake confidence + latency metadata.
model_class_filename: model.py
model_class_name: Model
python_version: py311
resources:
  cpu: "0.5"
  memory: 256Mi
  use_gpu: false
runtime:
  predict_concurrency: 4
