model_name: voice_agent_mocked__tts_handler
description: |
  Voice-agent showcase: TC Py HTTP handler. Calls TTSMock for synthesis,
  then appends an integrity hash to the resulting MOCKAUDIO bytes. The
  client (or entrypoint) can recompute the hash to verify the audio
  wasn't truncated en route.
model_class_filename: model.py
model_class_name: Model
python_version: py311
requirements:
  - truss @ git+https://github.com/basetenlabs/truss.git@matte/chains-trusschainlets
  - httpx>=0.27
resources:
  cpu: "0.5"
  memory: 512Mi
  use_gpu: false
runtime:
  predict_concurrency: 4
